---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ServiceType
source: html/d3e1a01b-c701-6a0e-c98d-353d9f658ac3.htm
---
# Autodesk.Revit.DB.FabricationPart.ServiceType Property

The service type identifier of the fabrication part.

## Syntax (C#)
```csharp
public int ServiceType { get; }
```